{
  "data": [
    {
      "image": "elroi.png",
      "title": "Elroi Church",
      "desc": "Webapp for Elroi Church, a Christian church located at sawangan.",
      "backendRole": "Creating Api for Elroi Church, and Elroi Church Admin, Change the orm of the app from typegoose to mongoose, Creating Api Documentation with swagger, compodoc and postman, implementing dto and repository design pattern, create giving feature using Mitrans Payment Gateway, Deploy App to the server.",
      "tags": [
        "NestJS",
        "Firebase Storage",
        "Midtrans",
        "Nginx",
        "Swagger",
        "Compodoc",
        "Postman"
      ],
      "links": "https://www.elroichurch.com/"
    },
    {
      "image": "wikopos.png",
      "title": "WikoPOS",
      "desc": "Web based Point of Sales App for managing retail business.",
      "backendRole": "Create Api manjorly for Crud Operation, and store products image to AWS S3, Create Login with Laravel Sanctum, perform query to generate report and invoice.",
      "frontendRole": "Create interactive and responsive web app interface using VueJS and TailwindCSS, using some library like chart.js sweet alert and etc, fetch data from api with axios and manage it with state management, create functions to print invoice",
      "tags": [
        "VueJS",
        "TailwindCSS",
        "Laravel",
        "AWS S3",
        "Spatie",
        "Laravel Sanctum",
        "Material Design Icons",
        "Vue Toast",
        "Sweet Alert"
      ],
      "frontend": "https://github.com/rdanang-dev/vue-wiko-pos",
      "backend": "https://github.com/rdanang-dev/laravel-wiko-pos",
      "demo": "https://www.youtube.com/watch?v=4gZuyLVo_7A"
    },
    {
      "image": "benefits_indonesia.png",
      "title": "Benefits Indonesia",
      "desc": "Dating App for Indonesian Couples.",
      "frontendRole": "Create web-based app for administrative purposes (accepting and rejecting profile verification/user reports, crud coins/plans), create architecure hierarchy for storing state management, entity, enums, and etc, creating forgot and reset password pages, creating download apps page on landing page sites.",
      "backendRole": "Implementing repository design pattern (controller, service, repository, dto, etc), create plan and features crud for integrations use in payment gateway, creating services for login with jwt auth, fixing bugs, creating mailing services for notify user about profile verification and reset passwords.",
      "devopsRole": "Creating shell script to deploy app to the server including (pulling last changes from git, installing dependencies, re-building apps, restaring pm2 services.",
      "tags": ["VueJS", "TailwindCSS", "Vue-Toasted"],
      "links": "https://benefits.co.id/",
      "demo": "https://youtube.com/watch?v=TIb8dPmRYCU"
    }
  ]
}
